Repository: sfeldeu/coderbot
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: Logic
de: Logik

source: Loops
de: Schleifen

source: Math
de: Mathe

source: Lists
de: Listen

source: list
de: Liste

source: Colour
de: Farbe

source: Variables
de: Variablen

source: Functions
de: Funktionen

source: Movement
de: Bewegung

source: Camera
de: Kamera

source: Sound
de: Ton

source: Control
de: Bedienung

source: Back
de: Zurück

source: Programming
de: Programmierung

source: Sounds
de: Töne

source: User Interface
de: Benutzer Schnittstelle

source: WiFi
de: WLAN

source: Restart, Halt
de: Neustart, Halt

source: Movement assisted by vision
de: Vision unterstützte Bewegung

source: Step timing | distance / angle
de: Schritt timing | Abstand / Winkel

source: Forward speed
de: Geschwindigkeit vorwärts

source: Show control counter
de: Zeige Anzahl Befehle

source: HUD image name
de: HUD Bild Name

source: Editor level
de: Editorstufe

source: Move
de: Bewegung

source: Basic
de: Enfach

source: Advanced
de: Fortgeschritten

source: Program editor details
de: Programm Editor Einzelheiten

source: Shows Editor scrollbars
de: Zeige Editor Scrollbalken

source: Save program before every run
de: Programm vor jeder Ausführung speichern

source: Other program parameters
de: Andere Programm Parameter

source: Auto record video on program run
de: Video bei Programmlauf automatisch aufnehmen

source: Max number of blocks allowed
de: Max erlaubte Blöcke

source: Start sound
de: Start Ton

source: Stop sound
de: Ende Ton

source: Shutter sound
de: Auslöser Ton

source: Camera parameters
de: Kamera Einstellungen

source: Exposure mode
de: Belichtung

source: Camera refresh timeout
de: Kamera todo

source: Camera jpeg quality
de: Kamera Jpeg Qualität

source: CV image resize factor (1/x)
de: CV Vergößerungsfaktor

source: Path object min size
de: Pfadobjekt Mindestgröße

source: Path object max size
de: Pfad Objekt Maximalgröße

source: Color object min size
de: Farbobjekt min Größe

source: Color object max size
de: Farbobjekt max Größe

source: Motor control mode
de: Motorsteuerung Art

source: Trim factor (1.0 = center)
de: Trimm Faktor (1.0 = Zentrum)

source: Load at start
de: Beim Start laden

source: Button function
de: Funktion des Buttons

source: None
de: Kein

source: Start/Stop current program
de: aktuelles Programm ausführen/anhalten

source: Show Control page
de: Zeige Bewegungsseite

source: Show Control movement commands
de: Zeige Bewegungs Kommandos

source: Show Program page
de: Zeige Programm Seite

source: Show Preferences button
de: Zeige Einstellungen Button

source: WiFi Client access mode
de: WLAN Client Modus

source: Halt
de: Anhalten

source: Restart
de: Neustart

source: Update System
de: System Update

source: Cancel
de: Abbrechen

source: Save
de: Speichern

source: WiFi Client mode access data
de: WLAN Client Modus

source: WiFi mode
de: WLAN Modus

source: WiFi name
de: WLAN Name

source: WiFi password
de: WLAN Kennwort

source: Apply Wifi config
de: WLAN Konfiguration anwenden

source: WiFi AP mode access
de: WLAN Access Point

source: Access Point mode is being set
de: Modus wurde auf Access Point gesetzt

source: Wait 30 seconds
de: Warte 30 Sekunden

source: Connect your device to the "coderbot" named wifi
de: Verbindung zu "coderbot" WLAN aufnehmen

source: Click on the following link
de: Auf den folgenen Link klicken

source: WiFi Client mode access
de: WLAN Client Modus

source: Client mode is being set
de: Client Modus wird gesezt

source: Connect your device to your own wifi (wifi network must be connected to internet)
de: Verbinde deinen bot mit dem eigenen WLAN (das WLAN Netz muss mit dem Internet verbunden sein)

source: Update log (it may require several minutes)
de: Aktualisierungsprotokoll (kann ein paar Minuten dauern)

source: Close
de: Schließen

source: Say what:
de: Sag was:

source: Saved
de: Gespeichert

source: Program saved
de: Programm gespeichert

source: Program name already in use, overwrite?
de: Programmname wird schon verwendet, überschreiben?

source: Delete
de: Löschen

source: Delete photo
de: Lösche Foto

source: Reset move counter?
de: Bewegungszähler zurücksetzen

source: is running
de: laufend

source: stopped
de: angehalten

source: Update System? (this requires that CoderBot is connected to the internet (via wifi or lan cable, the operation will take a few minutes).
de: System aktualisieren? (dazu muß der CoderBot mit dem Internet verbunden sein (mit WLAN oder Kabel, es wird einige Minuten dauern).

source: Preferences
de: Einstellungen

source: Program
de: Programm

source: Forward
de: vorwärts

source: Left
de: links

source: Right
de: rechts

source: Backward
de: zurück

source: Say
de: sage

source: Photo
de: Foto

source: Rec
de: Aufnahme

source: Photos
de: Fotos

source: Color at point:
de: Farbe bei:

source: New
de: Neu

source: Load
de: Laden

source: Run
de: Ausführen

source: Show last
de: Zeige letztes

source: Save as
de: Speichern unter

source: Show
de: Zeige

source: New Program
de: Neues Programm

source: Program name
de: Programm Name

source: Create
de: Erzeuge

source: Save Program As
de: Speichere Programm unter

source: Load Program
de: Lade Programm
